{
	"jobs": [
		{
			"company": "SECUDRIVE (Mobile App)",
			"company_url": "",
			"company_location": "Morocco.",
			"description": "The next-generation ride-sharing platform for the Moroccan market. Engineered a dual-transport logic that differentiates from standard platforms by offering Motorcycle transport options alongside cars, optimizing for urban traffic efficiency.",
			"positions": [],
			"showcase": {
				"image": "",
				"url": ""
			},
			"stack": [
				"Flutter",
				"Firebase",
				"Google Maps API",
				"Real-time WebSockets"
			],
			"highlights": [
				"Designed a real-time price negotiation algorithm",
				"Cross-platform deployment (iOS/Android) with a single codebase"
			]
		},
		{
			"company": "API Ecosystem @ Brink's Morocco",
			"company_url": "",
			"company_location": "Casablanca, Morocco.",
			"description": "Mission-critical API architecture for a global security leader. Transformed legacy data exchange into a high-performance GraphQL/RESTful hybrid ecosystem, prioritizing encryption and data integrity for sensitive financial transactions. As a Back-end Developer & API Specialist, I optimized architecture for data exchanges and reinforced system security through advanced programming interfaces.",
			"positions": [],
			"showcase": {
				"image": "",
				"url": ""
			},
			"stack": [
				"Java Spring Boot",
				"GraphQL",
				"Redis",
				"PostgreSQL"
			],
			"highlights": [
				"Reduced API latency by 40% through advanced query optimization",
				"Implemented 'Security by Design' protocols for critical data flows",
				"Conception and development of scalable RESTful and GraphQL APIs",
				"Analysis and refactoring of database queries for performance optimization",
				"Implementation of strict security standards for critical data exchanges (Authentication, Encryption)"
			]
		},
		{
			"company": "Legal Archive Management Workflow Automation @ Confidential Public Administration",
			"company_url": "",
			"company_location": "Khouribga, Morocco.",
			"description": "Full-stack digitalization of complex legal and administrative procedures for Confidential Public Administration (Ministry of Justice sector). Bridged the gap between rigid legal requirements and modern user experience. Built a secure, high-concurrency platform for sensitive file management. As a Full-Stack Web Developer, I led technical piloting and development of a digitalization solution for sensitive public administration procedures.",
			"positions": [],
			"showcase": {
				"image": "",
				"url": ""
			},
			"stack": [
				"PHP Laravel",
				"MySQL",
				"Vue.js",
				"Docker"
			],
			"highlights": [
				"Led the transition from paper-based to 100% digital workflows",
				"Architected a role-based access control (RBAC) system for high-level security",
				"Project management: Team coordination, roadmap definition, translation of complex legal requirements into technical functionalities (Business Analysis)",
				"Architecture & Development: Design of a secure platform for case management, reducing paperwork and optimizing internal workflows",
				"Data Security: Implementation of strict protocols to ensure integrity and confidentiality of sensitive data",
				"Technical Environment: Full Stack development, management of complex relational databases, API setup for service interoperability"
			]
		},
		{
			"company": "Industrial Interfaces @ OCP Group",
			"company_url": "",
			"company_location": "Khouribga, Morocco.",
			"description": "Responsive, high-availability web tools for the world's leading phosphate exporter. Created accessible and intuitive digital twins for industrial data, ensuring 100% responsiveness across all hardware (Desktop to Tablet). As a Web Developer & UI specialist, I developed intuitive digital interfaces in a demanding industrial environment, focused on user experience (UX) and accessibility.",
			"positions": [],
			"showcase": {
				"image": "",
				"url": ""
			},
			"stack": [
				"JavaScript (React/Node)",
				"Tailwind CSS",
				"Figma"
			],
			"highlights": [
				"Translated complex industrial KPIs into clean, actionable dashboards",
				"Maintained strict technical compliance within a massive corporate network",
				"Front-end Development: Creation of dynamic and responsive web pages, adapted to multi-device use (Desktop, Mobile, Tablet)",
				"Technical Compliance: Respect for web development standards to ensure compatibility and navigation fluidity within the corporate network"
			]
		}
	]
}